Repository: configr/opencloudmanifesto-i18n
Catalog: opencloudmanifesto.po
Languages: pt_br

source: Dedicated to the belief that the cloud should be open
pt_br: Dedicado à crença de que a nuvem deve ser aberta

source: This work is licensed under a Creative Commons Attribution-Share Alike 3.0 Unported License
pt_br: Este trabalho é licenciado sob a Licença Creative Commons Attribution-Share Alike 3.0 Unported

source: Introduction
pt_br: Introdução

source: The buzz around cloud computing has reached a fever pitch. Some believe it is a disruptive trend representing the next stage in the evolution of the Internet. Others believe it is hype, as it uses long established computing technologies. As with any new trend in the IT world, organizations must figure out the benefits and risks of cloudcomputing and the best way to use this technology.
pt_br: O burburinho sobre computação na nuvem virou febre. Alguns acreditam que é um tendência disruptiva que representa o próximo estágio da evolução da Internet. Outros acreditam que é só promoção, já que a nuvem usa tecnologias de computação estabelecidas há tempos. Como em qualquer nova tendência no mundo de TI, as organizações precisam calcular os benefícios e os riscos da computação na nuvem e a melhor forma de utilizar esta tecnologia.

source: One thing is clear: The industry needs an objective, straightforward conversation about how this new computing paradigm will impact organizations, how it can be used withexisting technologies, and the potential pitfalls of proprietary technologies that can lead to lock-in and limited choice.
pt_br: Uma coisa é clara: A indústria precisa de uma conversa direta e objetiva sobre como esse novo paradigma de computação irá impactar as organizações, como ele pode ser usado com tecnologias já existentes e as armadilhas potenciais de tecnologias proprietárias que podem levar a um "lock-in" e escolhas limitadas.

source: This document is intended to initiate a conversation that will bring together the emerging cloud computing community (both cloud users and cloud providers) arounda core set of principles. We believe that these core principles are rooted in the belief that cloud computing should be as open as all other IT technologies.
pt_br: Este documento destina-se a iniciar a conversa que reunirá a emergente comunidade de computação na nuvem (tanto usuários da nuvem quanto provedores) em torno de um conjunto de princípios básicos. Nós acreditamos que estes princípios básicos estão enraizados na crença que a computação na nuvem deve ser tão livre quanto todas as outras tecnologias de TI.

source: This document does not intend to define a final taxonomy of cloud computing or to charter a new standards effort. Nor does it try to be an exhaustive thesis on cloudarchitecture and design. Rather, this document is intended for CIOs, governments, IT users and business leaders who intend to use cloud computing and to establish a setof core principles for cloud providers. Cloud computing is still in its early stages, with much to learn and more experimentation to come. However, the time is right for themembers of the emerging cloud computing community to come together around the notion of an open cloud.
pt_br: Este documento não pretende definir a taxonomia final da computação na nuvem ou fundar um novo esforço de padrões. Nem tenta ser uma tese exaustiva sobre arquitetura e design da nuvem. Contudo, este documento destina-se a CIO's, governos, usuários de TI e donos de empresas que pretendem usar computação na nuvem e estabelecer um conjunto básico de princípios para provedores da nuvem. Computação na nuvem ainda está em estágio inicial, com muito para aprender e muita experimentação ainda. Entretanto, a hora é certa para os membros da emergente comunidade de computação na nuvem unir-se em torno da ideia de uma nuvem aberta.

source: What is Cloud Computing and Why is it Important?
pt_br: O que é Computação na Nuvem e porque isso é importante?

source: In order to understand the core principles of an open cloud, we need to first agree on some basic definitions and concepts of cloud computing itself. First, what is “thecloud”? The architecture and terminology of cloud computing is as clearly and precisely defined as, well, a cloud. Since cloud computing is really a culmination of manytechnologies such as grid computing, utility computing, SOA, Web 2.0, and other technologies, a precise definition is often debated.While definitions, taxonomies and architectures are interesting, it is more important to understand the value propositions for cloud computing. We need to understand howsuppliers of cloud technology will come together to deliver on the promise of cloud computing. The key characteristics of the cloud are the ability to scale and provision computing power dynamically in a cost efficient way and the ability of the consumer (end user, organization or IT staff) to make the most of that power without having to manage the underlying complexity of the technology. The cloud architecture itself can be private (hosted within an organization’s firewall) or public (hosted on the Internet). These characteristics lead to a set of core value propositions:
pt_br: Para entender os princípios básicos de uma nuvem aberta, nós precisamos antes concordar em algumas definições e conceitos da computação na nuvem. Primeiro, o que é "a nuvem"? A arquitetura e terminologia de computação na nuvem é claramente e precisamente definida como, bem, uma nuvem. Desde que computação na nuvem é realmente a culminação de várias tecnologias com computação em grid, "utility computing", SOA, Web 2.0 e outras tecnologias, uma definição precisa é frequentemente discutida. Enquanto definições, taxonomias e arquiteturas são interessantes, é ainda mais importante compreender as propostas de valor para computação na nuvem. Nós precisamos entender como fornecedores de tecnologia de nuvem se unirão para cumprir a promessa de computação na nuvem. As características chave da nuvem são a habilidade de escalar e provisionar poder computacional dinamicamente a um custo eficiente e a habilidade do consumidor (usuário final, organização ou equipe de TI) fazer o melhor desse poder sem ter que gerenciar a complexidade da tecnologia. A arquitetura da nuvem por si mesma pode ser privada (hospedada dentro do firewall de uma organização) ou pública (hospedada na Internet). Estas características levam a um conjunto central de proposições:

source: Scalability on Demand
pt_br: Escalabilidade sob Demanda

source: All organizations have to deal with changes in their environments. The ability of cloud computing solutions to scale up and down is a major benefit. If an organization hasperiods of time in which their computing resource needs are much higher or lower than normal, cloud technologies (both private and public) can deal with those changes.The organization pays for the IT resources it actually uses; it does not have to maintain multiple sets of artificially high levels of resources to handle peak demands.
pt_br: Todas as organizações tem que lidar com mudanças em seus ambientes. A habilidade das soluções de computação na nuvem para escalar para cima e para baixo é o benefício principal. Se uma organização tem períodos de tempo em que seus recursos computacionais precisam ser muito altos ou mais baixos que o normal, tecnologias da nuvem (tanto privada quanto pública) podem lidar com essas mudanças. A organização só paga pelos recursos de TI que ela usa; não precisa manter múltiplos conjuntos de de recursos de alto nível para lidar com demandas de pico.

source: Streamlining the Data Center
pt_br: Racionalização de Data Center

source: An organization of any size will have a substantial investment in its data center. That includes buying and maintaining the hardware and software, providing the facilities inwhich the hardware is housed and hiring the personnel who keep the data center running. An organization can streamline its data center by taking advantage of cloud technologies internally or by offloading workload into the public.
pt_br: Uma organização de qualquer tamanho terá um investimento substancial em seu data center. Isso inclui comprar e manter hardware e software, fornecer a estrutura física onde o hardware é hospedado e contratar pessoas para manter o data center funcionando. Uma organização pode racionalizar seu data center aproveitando as tecnologias da nuvem internamente ou colocando essa carga em uma nuvem pública.

source: Improving Business Processes
pt_br: Melhora dos Processos de Negócio

source: The cloud provides an infrastructure for improving business processes. An organization and its suppliers and partners can share data and applications in the cloud, allowingeveryone involved to focus on the business process instead of the infrastructure that hosts it.
pt_br: A nuvem fornece uma infraestrutura para melhorar os processos de negócio. Uma organização e seus fornecedores e parceiros podem compartilhar dados e aplicações na nuvem, permitindo que os envolvidos possam focar no negócio invés de focar na infraestrutura para hospedá-lo.

source: Minimizing Startup Costs
pt_br: Minimizando Custos de Startup

source: For companies that are just starting out, organizations in emerging markets, or even “Skunk Works” groups in larger organizations, cloud computing greatly reduces startupcosts. The new organization starts with an infrastructure already in place, so the time and other resources that would be spent on building a data center are borne by thecloud provider, whether the cloud is private or public.
pt_br: Para empresas que estão apenas começando, organizações em mercados emergentes, ou mesmo para os grupos chamados de “Skunk Works” de empresas maiores, computação na nuvem reduz enormemente os custos. A nova organização começa já com a infraestrutura pronta, então o tempo e os recursos que seriam gastos na construção do data center são por conta do provedor da nuvem, seja ela pública ou privada.

source: Challenges and Barriers to Adoption
pt_br: Desafios e Barreiras da Adoção

source: Although the cloud presents tremendous opportunity and value for organizations, the usual IT requirements (security, integration, and so forth) still apply. In addition, somenew issues come about because of the multi-tenant nature (information from multiple companies may reside on the same physical hardware) of cloud computing, the merger of applications and data, and the fact that a company’s workloads might reside outside of their physical on-premise datacenter. This section examines five main challenges that cloud computing must address in order to deliver on its promise.
pt_br: Embora a nuvem apresente oportunidade e valor extraordinários para as organizações, os requerimentos normais de TI (segurança, integração, etc.) ainda se aplicam. E mais, alguns problemas novos aparecem por causa da natureza compartilhada da computação na nuvem (informação de várias empresas no mesmo hardware físico), a fusão de aplicações e dados, e o fato de que a carga de trabalho da empresa está fora da sua estrutura física. Esta seção examina cinco desafios principais que a computação na nuvem precisa resolver para entregar sua promessa.

source: Security
pt_br: Segurança

source: Many organizations are uncomfortable with the idea of storing their data and applications on systems they do not control. Migrating workloads to a shared infrastructure increases the potential for unauthorized access and exposure. Consistency around authentication, identity management, compliance, and access technologies will become increasingly important. To reassure their customers, cloud providers must offer a high degree of transparency into their operations.
pt_br: Muitas organizações estão desconfortáveis com a ideia de armazenar seus dados e aplicações em sistemas que elas não controlam. Migrar a carga de trabalho para infraestruturas compartilhadas aumenta a possibilidade de acesso não-autorizado e exposição. Consistência de autenticação, gerenciamento de identidade, observância, e tecnologias de acesso se tornarão cada vez mais importantes. Para tranquilizar seus clientes, provedores de nuvem precisam oferecer um alto nível de transparência nas suas operações.

source: Data and Application Interoperability
pt_br: Interoperabilidade de Dados e Aplicação

source: It is important that both data and applications systems expose standard interfaces. Organizations will want the flexibility to create new solutions enabled by data andapplications that interoperate with each other regardless of where they reside (public clouds, private clouds that reside within an organization’s firewall, traditional ITenvironments or some combination). Cloud providers need to support interoperability standards so that organizations can combine any cloud provider’s capabilities into their solutions.
pt_br: É importante que os dados e sistemas de aplicações exibam interfaces padrão. Organizações desejarão flexibilidade para criar novas soluções ativadas por dados e aplicações que operem entre si sem se importar onde estão hospedados (nuvens pública ou privadas, que estão dentro do firewall de uma organização, ambientes tradicionais de TI ou alguma combinação disso). Provedores de nuvem precisam suportar padrões de interoperabilidade para que as organizações possam combinar a capacidade de qualquer provedor de nuvem nas suas soluções.

source: Data and Application Portability
pt_br: Portabilidade de Dados e Aplicação

source: Without standards, the ability to bring systems back in-house or choose another cloud provider will be limited by proprietary interfaces. Once an organization builds or portsa system to use a cloud provider’s offerings, bringing that system back in-house will be difficult and expensive.
pt_br: Sem padrões, a habilidade de trazer os sistemas de volta para dentro da organização ou escolher outro provedor de nuvem será limitado por interfaces proprietárias. Uma vez que a organização construa ou porte um sistema para usar os recursos de um provedor de nuvem, trazer esse sistema de volta para dentro da empresa será difícil e caro.

source: Governance and Management
pt_br: Governança e Gerenciamento

source: As IT departments introduce cloud solutions in the context of their traditional datacenter, new challenges arise. Standardized mechanisms for dealing with lifecyclemanagement, licensing, and chargeback for shared cloud infrastructure are just some of the management and governance issues cloud providers must work together to resolve.
pt_br: Novos desafios aparecerão no momento que Departamentos de TI apresentando soluções de nuvem no contexto de data center tradicional. Mecanismos padrão para lidar com o ciclo de vida do gerenciamento, licenciamento e cobranças não autorizadas são somente alguns dos problemas de gerenciamento e governança que os provedores de nuvem terão que trabalhar juntos para resolver.

source: Metering and Monitoring
pt_br: Medição e Monitoramento

source: Business leaders will want to use multiple cloud providers in their IT solutions and will need to monitor system performance across these solutions. Providers must supplyconsistent formats to monitor cloud applications and service performance and make them compatible with existing monitoring systems.It is clear that the opportunity for those who effectively utilize cloud computing in their organizations is great. However, these opportunities are not without risks and barriers. It is our belief that the value of cloud computing can be fully realized only when cloud providers ensure that the cloud is open.
pt_br: Líderes de empresas desejarão usar múltiplos provedores de nuvem nas suas soluções de TI e precisarão monitorar o desempenho do sistema através dessas soluções. Provedores precisam fornecer formatos consistentes para monitorar aplicações na nuvem e desempenho dos serviços e torná-los compatíveis com sistemas de monitoramento já existentes. É claro que é uma grande oportunidade para os que já utilizam efetivamente computação na nuvem em suas organizações. Entretanto, essas oportunidade têm riscos e barreiras. Nós acreditamos que o valor da computação na nuvem só pode ser totalmente calculado quando provedores de nuvem garantirem que a nuvem é aberta.

source: The Goals of an Open Cloud
pt_br: Os objetivos da Nuvem Aberta

source: Customers expect that the cloud services they use will be as open as the rest of their IT choices. As an open cloud becomes a reality, business leaders will benefit in severalways.
pt_br: Os clientes esperam que os serviços de nuvem que eles usam sejam abertos como todas as outras opções de TI. No momento que a nuvem aberta se tornar uma realidade, líderes empresariais se beneficiarão de diversas maneiras.

source: Choice
pt_br: Escolha

source: As an organization chooses a provider or architecture or usage model, an open cloud will make it easy for them to use a different provider or architecture as the businessenvironment changes. If the organization needs to change providers because of new partnerships, acquisition, customer requests or government regulations, they can do so easily. If the organization deploys a private cloud, they can choose between providers as they extend their capacity and/or functional capabilities. Resources that would have been spent on a difficult migration can instead be spent on innovation.
pt_br: Ao uma organização escolher um provedor ou uma arquitetura ou um modelo de uso, uma nuvem aberta irá tornar fácil para a organização usar um provedor ou arquitetura diferente porque o ambiente de negócios muda. Se a organização precisa mudar de provedores por causa de uma nova parceria, aquisição, solicitação de clientes ou regulamentação governamental, eles podem fazer isso facilmente. Se a organização implementa uma nuvem privada, eles podem escolher entre provedores para estender sua capacidade ou capacidades funcionais. Recursos que seriam gastos em uma migração difícil podem ser gastos em inovação.

source: Flexibility
pt_br: Flexibilidade

source: No matter which cloud provider and architecture an organization uses, an open cloud will make it easy for them to work with other groups, even if those other groupschoose different providers and architectures. An open cloud will make it easy for organizations to interoperate between different cloud providers.
pt_br: Não importa qual provedor de nuvem ou qual arquitetura a organização use, uma nuvem aberta facilitará para que eles possam trabalhar com outros grupos, mesmo que os outros grupos escolham diferentes provedores e arquiteturas. Uma nuvem aberta facilitará a interoperação entre diferentes provedores para as organizações.

source: Speed and Agility
pt_br: Velocidade e Agilidade

source: One of the value propositions of cloud computing is the ability to scale hardware and software as needed. Using open interfaces allows organizations to build new solutionsthat integrate public clouds, private clouds and current IT systems. As the conditions of the organization change, an open cloud will let the organization respond with speedand agility.
pt_br: Uma das propostas da computação na nuvem é a habilidade de escalar hardware e software quando preciso. Usar interfaces abertas permite às organizações construir novas soluções que integram nuvens públicas, nuvens privadas e sistemas de TI existentes. Como as condições da organização mudam, uma nuvem aberta permitirá que a organização responda ágil e rapidamente.

source: A side effect of an open cloud is the availability of skilled professionals. If there are many proprietary programming models, a given IT professional is unlikely to knowmore than a few of them. With an open cloud, there will be a smaller set of new technologies to learn (especially when existing technologies are utilized), greatly enhancing the chances that the organization can find someone with the necessary skills.
pt_br: Um efeito colateral de uma nuvem aberta é a disponibilidade de profissionais capacitados. Se há muitos modelos proprietários de programação, um profissional de TI provavelmente não conhecerá mais do que poucos. Com a nuvem aberta, haverá um pequeno conjuntos de tecnologias para aprender (especialmente quando tecnologias existentes são utilizadas), aumentando enormemente as chances da organização encontrar alguém com o conhecimento necessário.

source: Principles of an Open Cloud
pt_br: Princípios da Nuvem Aberta

source: Of course, many clouds will continue to be different in a number of important ways, providing unique value for organizations. It is not our intention to define standards forevery capability in the cloud and create a single homogeneous cloud environment. Rather, as cloud computing matures, there are several key principles that must be followed to ensure the cloud is open and delivers the choice, flexibility and agility organizations demand:
pt_br: Claro que muitas nuvens continuarão a ser diferentes de várias maneiras importantes, fornecendo valor único para organizações. Não é nossa intenção definir padrões para cada capacidade na nuvem e criar um único e homogêneo ambiente de nuvem. Entretanto, a computação na nuvem amadurecendo, haverão diversos princípios chave que precisam ser seguidos para garantir que a nuvem é aberta e que entrega escolha, flexibilidade e agilidade que as organizações precisam:

source: 1. Cloud providers must work together to ensure that the challenges to cloud adoption (security, integration, portability, interoperability, governance/management, metering/monitoring) are addressed through open collaboration and the appropriate use of standards.
pt_br: 1. Provedores de nuvem precisam trabalhar juntos para garantir que os desafios da adoção da nuvem (segurança, integração, portabilidade, interoperabilidade, governança/gerenciamento, medição/monitoramento) sejam resolvidos através de colaboração aberta e com o uso apropriado de padrões.

source: 2. Cloud providers must not use their market position to lock customersinto their particular platforms and limit their choice of providers.
pt_br: 2. Provedores de nuvem não podem usar sua posição no mercado para prender clientes em sua plataforma limitando a escolha de provedores.

source: 3. Cloud providers must use and adopt existing standards wherever appropriate. The IT industry has invested heavily in existing standards and standards organizations; there is no need to duplicate or reinvent them.
pt_br: 3. Provedores de nuvem precisam usar e adotar padrões existentes sempre que apropriado. A indústria de TI investiu fortemente nos padrões existente e nas organizações normalizadoras; não há necessidade de duplicar ou reinventá-los.

source: 4. When new standards (or adjustments to existing standards) are needed, we must be judicious and pragmatic to avoid creating too many standards. We must ensure that standards promote innovation and do not inhibit it.
pt_br: 4. Quando novos padrões (ou ajustes em padrões existentes) forem necessários, nós precisamos ser criteriosos e pragmáticos para evitar a criação de muitos padrões. Precisamos garantir que os padrões promovam inovação e não a inibam.

source: 5. Any community effort around the open cloud should be driven by customer needs, not merely the technical needs of cloud providers, and should be tested or verified against real customer requirements.
pt_br: 5. Qualquer esforço da comunidade sobre a nuvem aberta deve ser dirigido às necessidade dos clientes, não simplesmente necessidades técnicas de provedores de nuvem, e devem ser testadas ou verificadas com requisitos reais de clientes.
