Repository: configr/opencloudmanifesto-i18n
Catalog: opencloudmanifesto.po
Languages: pt_br

source: 6. Cloud computing standards organizations, advocacy groups, and communities should work together and stay coordinated, making sure that efforts do not conflict or overlap.
pt_br: 6. Organizações de padrões de computação na nuvem, grupos de apoio e comunidades devem trabalhar juntos e manter-se unidos, para ter certeza que seus esforços não conflitem ou se sobreponham.

source: Conclusion
pt_br: Conclusão

source: This document is meant to begin the conversation, not define it. Many details (taxonomies, definitions and scenarios, for example) will be filled in as the cloud computing community comes together. We have outlined the challenges facing organizations that want to take advantage of the cloud. These issues lead to a call to action for the IT industry around a vision of an open cloud. We as industry participants must work together to ensure that the cloud remains as open as all other IT technologies. Some might argue that it is too early to discuss topics such as standards, interoperability, integration and portability. Although this is a time of great innovation for the cloud computing community, that innovation should be guided by the principles of openness outlined in this document. We argue that it is exactly the right time to begin the work to build the open cloud. Companies and organizations that support the open cloud manifesto are listed at: www.opencloudmanifesto.org
pt_br: O objetivo deste documento é iniciar uma conversação, não defini-la. Muitos detalhes (taxonomias, definições e cenários, por exemplo) serão preenchidos quando a comunidade de computação na nuvem se unir. Nós esboçamos os desafios que as organizações que querem tirar proveito da nuvem enfrentarão. Estes problemas levarão a uma chamada de ação da indústria de TI sobre a visão de nuvem aberta. Nós, como participantes da indústria, precisamos trabalhar juntos para garantir que a nuvem seja tão aberta quanto todas as outras tecnologias de TI. Alguns podem dizer que é muito cedo para discutir tópicos como padrões, interoperabilidade, integração e portabilidade. Embora este seja o momento de grande inovação para a comunidade de computação na nuvem, essa inovação deve ser guiada pelos princípios de liberdade contidos nesse documento. Nós podemos dizer que este é o momento certo para começar o trabalho de construir a nuvem aberta. Empresas e organizações que apoiam o open cloud manifesto estão listadas em: www.opencloudmanifesto.org
